Revit 2027 API
StructuralFramingUtils.FlipEnds Method
 Flips the ends of the structural framing element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void FlipEnds(
	FamilyInstance familyInstance
)
Public Shared Sub FlipEnds (
	familyInstance As FamilyInstance
)
public:
static void FlipEnds(
	FamilyInstance^ familyInstance
)
static member FlipEnds :
        familyInstance : FamilyInstance -> unit
Parameters
familyInstance FamilyInstance
 The FamilyInstance, which must be of a structural framing category, non-concrete.
Exceptions
Exception | Condition
ArgumentException |  The input familyInstance is concrete or is not a line, arc or ellipse element.
ArgumentNullException |  A non-optional argument was null
ArgumentsInconsistentException |  The input familyInstance is not of a structural framing category.
Remarks
 Only ends of non-concrete structural framing element like beam and brace can be flipped and only in case if it is a line, arc or ellipse element.
See Also
Reference
StructuralFramingUtils Class
Autodesk.Revit.DB.Structure Namespace